In [2]:
import pandas as pd
import numpy as np

In [3]:
# pd.DataFrame(veri,index=..,columns=...)
veri_tablosu = pd.DataFrame([['d',7,3],['a',2,3],['s',3,6],['a',3,7]],index=['A','B','C','D'],columns=['X','Y','Z'])
print(veri_tablosu)

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [7]:
veri_tablosu.info() # info() Data frame hakkında bilgi verir.

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       4 non-null      object
 1   Y       4 non-null      int64
 2   Z       4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [8]:
veri_tablosu

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [9]:
veri_tablosu['Y'] # Y kolonu

A    7
B    2
C    3
D    3
Name: Y, dtype: int64

In [12]:
df_xz = veri_tablosu[['X','Z']] # birden fazla data frame kolonu

In [13]:
df_xz

   X  Z
A  d  3
B  a  3
C  s  6
D  a  7

In [14]:
veri_tablosu

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [15]:
# B ve C satırlarını seçmek için
veri_tablosu.loc[['B','D']]

   X  Y  Z
B  a  2  3
D  a  3  7

In [16]:
veri_tablosu.loc['A']

X    d
Y    7
Z    3
Name: A, dtype: object

In [17]:
# index isimleri yerine index numaralarını kullanmak için iloc
veri_tablosu.iloc[[1,3]]

   X  Y  Z
B  a  2  3
D  a  3  7

In [18]:
veri_tablosu

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [19]:
# X, ve Z kolonlar + B ve D satırları seçilsin:
veri_tablosu[['X','Z']].loc[['B','D']]

   X  Z
B  a  3
D  a  7

In [20]:
# X, ve Z kolonlar + B ve D satırları seçilsin:
# iloc ile seçim?
veri_tablosu[["X","Z"]].iloc[[1,3]] # Mertcan

   X  Z
B  a  3
D  a  7

In [21]:
veri_tablosu.iloc[[1, 3]][['X','Z']] # Bilal

   X  Z
B  a  3
D  a  7

In [22]:
# Koşullu Seçim
veri_tablosu

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [23]:
veri_tablosu[veri_tablosu['Z']>5] # Z kolon değeri 5'den büyük olan kayıtları seç

   X  Y  Z
C  s  3  6
D  a  3  7

In [24]:
veri_tablosu['Z']>5

A    False
B    False
C     True
D     True
Name: Z, dtype: bool

In [25]:
# X kolon değeri 'a' olan kayıtları
veri_tablosu[veri_tablosu['X']=='a']

   X  Y  Z
B  a  2  3
D  a  3  7

In [26]:
veri_tablosu

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [27]:
# Z kolonu 5'ten küçük VE Y kolonu 3'den büyük olan kayıt?
veri_tablosu[(veri_tablosu['Z']<5) & (veri_tablosu['Y']>3)]

   X  Y  Z
A  d  7  3

In [29]:
# Alternatif yok Numpy ile
veri_tablosu[np.logical_and(veri_tablosu['Z']<5, veri_tablosu['Y']>3)]

   X  Y  Z
A  d  7  3

In [36]:
veri_tablosu[(veri_tablosu['Z']<5) & (veri_tablosu['Y']>3)]['X'] # koşulları sağlayan kayıtın 'X' değeri

A    d
Name: X, dtype: object

In [35]:
veri_tablosu[(veri_tablosu['Z']<5) & (veri_tablosu['Y']>3)][['X']] # koşulları sağlayan kayıtın 'X' değeri

   X
A  d

In [37]:
veri_tablosu

   X  Y  Z
A  d  7  3
B  a  2  3
C  s  3  6
D  a  3  7

In [4]:
# Yeni bir kolon eklemek için
veri_tablosu['W']=[9, 2, 5, 9] # data_frame['yeni_kolon_ad']=[degerler...]

In [5]:
veri_tablosu

   X  Y  Z  W
A  d  7  3  9
B  a  2  3  2
C  s  3  6  5
D  a  3  7  9

In [40]:
# Alıştırma: 
# veri_tablosu data frame'inde W kolon değeri 4'ten büyük, Y değeri 5'ten küçük, Z değeri 6'dan büyük X değeri kaçtır?

In [42]:
veri_tablosu[(veri_tablosu["W"] > 4) & (veri_tablosu["Y"] < 5) & (veri_tablosu["Z"] > 6)][['X']] # Mertcan

   X
D  a

In [44]:
veri_tablosu[(veri_tablosu['W']>4) & (veri_tablosu['Y']<5) & (veri_tablosu['Z']>6)][['X']] #Enes

   X
D  a

In [10]:
# Bir data frame'in index değerleri
veri_tablosu.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
veri_tablosu.reset_index()

  index  X  Y  Z  W
0     A  d  7  3  9
1     B  a  2  3  2
2     C  s  3  6  5
3     D  a  3  7  9

In [13]:
veri_tablosu

   X  Y  Z  W
A  d  7  3  9
B  a  2  3  2
C  s  3  6  5
D  a  3  7  9

In [14]:
veri_tablosu.reset_index(inplace=True) # orjinal data frame index reset için

In [15]:
veri_tablosu

  index  X  Y  Z  W
0     A  d  7  3  9
1     B  a  2  3  2
2     C  s  3  6  5
3     D  a  3  7  9

In [16]:
# Yeni bir data frame
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [17]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145 -0.103773  0.501539 -3.038628
D  0.446293  0.729910  1.519462  1.277510
E  0.667044  0.719747 -2.255128 -0.799106

In [18]:
df['X'].loc['C']='-'

In [19]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145         -  0.501539 -3.038628
D  0.446293   0.72991  1.519462  1.277510
E  0.667044  0.719747 -2.255128 -0.799106

In [23]:
df['Z'].loc['E']='-'

C:\Users\yasar\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [24]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145         -  0.501539 -3.038628
D  0.446293   0.72991  1.519462   1.27751
E  0.667044  0.719747 -2.255128         -

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      object
 2   Y       5 non-null      float64
 3   Z       5 non-null      object
dtypes: float64(2), object(2)
memory usage: 372.0+ bytes

In [35]:
# - olan kolonları (object) => sayısal değere dönüştür
df['X']=pd.to_numeric(df['X'],errors = 'coerce')
df['Z']=pd.to_numeric(df['Z'],errors = 'coerce')

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       4 non-null      float64
 2   Y       5 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [38]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145       NaN  0.501539 -3.038628
D  0.446293  0.729910  1.519462  1.277510
E  0.667044  0.719747 -2.255128       NaN

In [39]:
# dropna() => sayı olmayan değerleri içeren SATIRLAR  data frame'den çıkarır
df.dropna()

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
D  0.446293  0.729910  1.519462  1.277510

In [40]:
df # dropna() ile orjinal data frame değişmez

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145       NaN  0.501539 -3.038628
D  0.446293  0.729910  1.519462  1.277510
E  0.667044  0.719747 -2.255128       NaN

In [41]:
df1 = df.dropna()

In [42]:
df1

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
D  0.446293  0.729910  1.519462  1.277510

In [43]:
df.dropna(axis=1) # sayı değeri içermeyen KOLONLAR çıkarılır

          W         Y
A -1.941538 -0.622670
B  1.108641 -0.202226
C  1.059145  0.501539
D  0.446293  1.519462
E  0.667044 -2.255128

In [44]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145       NaN  0.501539 -3.038628
D  0.446293  0.729910  1.519462  1.277510
E  0.667044  0.719747 -2.255128       NaN

In [ ]:
# NaN değerleri içeren satır veya kolonları silmek yerine yeni bir değer atanabilir.
# fillna

In [49]:
df['X']=df['X'].fillna(value=0) # NaN değerleri 0 olarak değiştir

In [50]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145  0.000000  0.501539 -3.038628
D  0.446293  0.729910  1.519462  1.277510
E  0.667044  0.719747 -2.255128       NaN

In [53]:
df['Z']=df['Z'].fillna(value=df['Z'].mean())

In [54]:
df

          W         X         Y         Z
A -1.941538 -1.459188 -0.622670 -0.658598
B  1.108641  0.044138 -0.202226  0.060645
C  1.059145  0.000000  0.501539 -3.038628
D  0.446293  0.729910  1.519462  1.277510
E  0.667044  0.719747 -2.255128 -0.589768

In [56]:
# Satır ve Sütun İşlemleri
df.mean() # sütun değerlerinin ortalaması

W    1.339585
X    0.034607
Y   -1.059023
Z   -2.948839
dtype: float64

In [57]:
df.max() # sütun değerlerinin en yükseği

W    1.108641
X    0.729910
Y    1.519462
Z    1.277510
dtype: float64

In [58]:
df.min() # sütun değerlerinin en düşükleri

W   -1.941538
X   -1.459188
Y   -2.255128
Z   -3.038628
dtype: float64

In [59]:
df.mean(axis=1) # satır ortalamarı

A   -1.170498
B    0.252799
C   -0.369486
D    0.993294
E   -0.364526
dtype: float64

# GRUPLAMA

In [64]:
# pd.DataFrame({kolon1:degerler, kolon2:degerler, ... })
df = pd.DataFrame({'Isim':['Ahmet','Mehmet','Ayşe','Cemil','Fatma'],'Yas':[45, 28, 32, 29, 45],'Firma':['Aras','Aras','PTT','PTT','Yurtiçi']})

In [65]:
df

     Isim  Yas    Firma
0   Ahmet   45     Aras
1  Mehmet   28     Aras
2    Ayşe   32      PTT
3   Cemil   29      PTT
4   Fatma   45  Yurtiçi

In [66]:
df['Yas'].mean() # Çalışanların TAMAMININ ortalama yaşı

35.8

In [68]:
# Firma bazlı ortalama yaş
df.groupby("Firma").mean() # data_frame.groupby("??").hesaplama()

          Yas
Firma
Aras     36.5
PTT      30.5
Yurtiçi  45.0

In [71]:
df.groupby("Firma").count() # Şirketlerin kaçar çalışanı var

         Isim  Yas
Firma
Aras        2    2
PTT         2    2
Yurtiçi     1    1

In [70]:
df.count()

Isim     5
Yas      5
Firma    5
dtype: int64

In [69]:
df.groupby("Firma").min()

          Isim  Yas
Firma
Aras     Ahmet   28
PTT       Ayşe   29
Yurtiçi  Fatma   45

In [72]:
df.describe()

             Yas
count   5.000000
mean   35.800000
std     8.526429
min    28.000000
25%    29.000000
50%    32.000000
75%    45.000000
max    45.000000

In [73]:
df.groupby("Firma").describe()

          Yas
        count  mean        std   min    25%   50%    75%   max
Firma
Aras      2.0  36.5  12.020815  28.0  32.25  36.5  40.75  45.0
PTT       2.0  30.5   2.121320  29.0  29.75  30.5  31.25  32.0
Yurtiçi   1.0  45.0        NaN  45.0  45.00  45.0  45.00  45.0

In [74]:
df.transpose() # Transpose - satır ve kolonların yerini değiştirmek

           0       1     2      3        4
Isim   Ahmet  Mehmet  Ayşe  Cemil    Fatma
Yas       45      28    32     29       45
Firma   Aras    Aras   PTT    PTT  Yurtiçi

In [75]:
# Alıştırmalar

In [76]:
veri = pd.DataFrame(np.random.randn(100,5), columns='A B C D E'.split())

In [77]:
veri

           A         B         C         D         E
0   0.732676 -1.275458  1.460971 -0.621580  1.365645
1  -1.977610  0.308268 -0.224485  0.979607 -0.239182
2   1.250964 -1.059337 -0.076456  0.865833  0.779752
3  -1.388618  0.347296  0.667890 -0.518071  0.886412
4   0.632043 -0.324279  0.120423 -0.019623 -0.732555
..       ...       ...       ...       ...       ...
95 -1.222998  0.446758  0.442400 -0.520854  0.507285
96 -1.107913  0.687686 -0.379690 -0.025682 -0.391572
97  0.517636 -2.074624  0.990741  0.699103  0.419325
98  1.270136 -0.534249 -1.421604 -0.260411  0.109947
99 -1.123784 -0.696443 -0.817646  0.788393 -0.262362

[100 rows x 5 columns]

In [ ]:
# Yeni bir kolon ekleyiniz, kolon adı: F, değerler 100 tane rasgele sayı

In [78]:
veri['F'] = np.random.randn(100) # Bilal

In [79]:
veri

           A         B         C         D         E         F
0   0.732676 -1.275458  1.460971 -0.621580  1.365645  1.965665
1  -1.977610  0.308268 -0.224485  0.979607 -0.239182 -0.293089
2   1.250964 -1.059337 -0.076456  0.865833  0.779752  2.136457
3  -1.388618  0.347296  0.667890 -0.518071  0.886412  0.103911
4   0.632043 -0.324279  0.120423 -0.019623 -0.732555  0.802697
..       ...       ...       ...       ...       ...       ...
95 -1.222998  0.446758  0.442400 -0.520854  0.507285  0.474286
96 -1.107913  0.687686 -0.379690 -0.025682 -0.391572  0.826240
97  0.517636 -2.074624  0.990741  0.699103  0.419325 -0.469381
98  1.270136 -0.534249 -1.421604 -0.260411  0.109947 -0.532926
99 -1.123784 -0.696443 -0.817646  0.788393 -0.262362 -0.578862

[100 rows x 6 columns]

In [80]:
veri['G']=np.random.rand(100) # Enes

In [81]:
veri

           A         B         C         D         E         F         G
0   0.732676 -1.275458  1.460971 -0.621580  1.365645  1.965665  0.151843
1  -1.977610  0.308268 -0.224485  0.979607 -0.239182 -0.293089  0.694225
2   1.250964 -1.059337 -0.076456  0.865833  0.779752  2.136457  0.435525
3  -1.388618  0.347296  0.667890 -0.518071  0.886412  0.103911  0.425677
4   0.632043 -0.324279  0.120423 -0.019623 -0.732555  0.802697  0.303491
..       ...       ...       ...       ...       ...       ...       ...
95 -1.222998  0.446758  0.442400 -0.520854  0.507285  0.474286  0.321838
96 -1.107913  0.687686 -0.379690 -0.025682 -0.391572  0.826240  0.858322
97  0.517636 -2.074624  0.990741  0.699103  0.419325 -0.469381  0.996759
98  1.270136 -0.534249 -1.421604 -0.260411  0.109947 -0.532926  0.090262
99 -1.123784 -0.696443 -0.817646  0.788393 -0.262362 -0.578862  0.809963

[100 rows x 7 columns]

In [82]:
# Soru: Kolon değerlerini ortalaması
veri.mean()

A   -0.013158
B   -0.064689
C   -0.166680
D    0.081038
E    0.035484
F   -0.022328
G    0.472352
dtype: float64

In [83]:
# A, C, F kolonlarını seçiniz
veri['A C F'.split()] # Bilal

           A         C         F
0   0.732676  1.460971  1.965665
1  -1.977610 -0.224485 -0.293089
2   1.250964 -0.076456  2.136457
3  -1.388618  0.667890  0.103911
4   0.632043  0.120423  0.802697
..       ...       ...       ...
95 -1.222998  0.442400  0.474286
96 -1.107913 -0.379690  0.826240
97  0.517636  0.990741 -0.469381
98  1.270136 -1.421604 -0.532926
99 -1.123784 -0.817646 -0.578862

[100 rows x 3 columns]

In [84]:
veri[['A','C','F']] # Enes

           A         C         F
0   0.732676  1.460971  1.965665
1  -1.977610 -0.224485 -0.293089
2   1.250964 -0.076456  2.136457
3  -1.388618  0.667890  0.103911
4   0.632043  0.120423  0.802697
..       ...       ...       ...
95 -1.222998  0.442400  0.474286
96 -1.107913 -0.379690  0.826240
97  0.517636  0.990741 -0.469381
98  1.270136 -1.421604 -0.532926
99 -1.123784 -0.817646 -0.578862

[100 rows x 3 columns]

In [85]:
# Soru: F kolonun 0.1'den büyük olan değerlerini seçiniz

In [87]:
veri[veri['F'] > 0.1][['F']].count() # Bilal

F    50
dtype: int64

In [ ]:
# Soru: A kolonu 0'dan küçük VE C kolonu 0'dan büyük olan kaç tane kayıt vardır?

In [88]:
veri[(veri['A'] < 0) & (veri['C'] > 0)].count()

A    26
B    26
C    26
D    26
E    26
F    26
G    26
dtype: int64